```
=========> Existing resources:
[command]/usr/local/vss-agent/2.309.0/_work/_temp/e2cc0ff5-5757-4df5-9aa3-a8605bfb03c7/terraform-bin state list
module.acr.data.azurerm_container_registry_scope_map.pull
module.acr.data.azurerm_container_registry_scope_map.push
module.acr.azurerm_container_registry.this
module.acr.azurerm_container_registry_token.pull
module.acr.azurerm_container_registry_token.push
module.acr.azurerm_container_registry_token_password.pull_password
module.acr.azurerm_container_registry_token_password.push_password
module.acr.azurerm_private_dns_a_record.data
module.acr.azurerm_private_dns_a_record.login_server
module.acr.azurerm_private_dns_zone.pdz
module.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private
module.acr.azurerm_private_endpoint.pep
module.acr.azurerm_subnet.acr
module.acr.azurerm_subnet.container_apps
module.acr.azurerm_virtual_network.vnet
module.resource_group.azurerm_resource_group.this
module.acr.module.public_ip.data.curl.big_data_cloud
::debug::Terraform exited with code 0.
::debug::stdout: module.acr.data.azurerm_container_registry_scope_map.pull%0Amodule.acr.data.azurerm_container_registry_scope_map.push%0Amodule.acr.azurerm_container_registry.this%0Amodule.acr.azurerm_container_registry_token.pull%0Amodule.acr.azurerm_container_registry_token.push%0Amodule.acr.azurerm_container_registry_token_password.pull_password%0Amodule.acr.azurerm_container_registry_token_password.push_password%0Amodule.acr.azurerm_private_dns_a_record.data%0Amodule.acr.azurerm_private_dns_a_record.login_server%0Amodule.acr.azurerm_private_dns_zone.pdz%0Amodule.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private%0Amodule.acr.azurerm_private_endpoint.pep%0Amodule.acr.azurerm_subnet.acr%0Amodule.acr.azurerm_subnet.container_apps%0Amodule.acr.azurerm_virtual_network.vnet%0Amodule.resource_group.azurerm_resource_group.this%0Amodule.acr.module.public_ip.data.curl.big_data_cloud%0A
::debug::stderr: 
::debug::exitcode: 0
[command]/usr/local/vss-agent/2.309.0/_work/_temp/e2cc0ff5-5757-4df5-9aa3-a8605bfb03c7/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.acr.data.azurerm_container_registry_scope_map.pull will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_container_registry_scope_map" "pull" {
      + actions                 = (known after apply)
      + container_registry_name = "avmtelemetry"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "_repositories_pull"
      + resource_group_name     = "avm-telemetry"
    }

  # module.acr.data.azurerm_container_registry_scope_map.push will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_container_registry_scope_map" "push" {
      + actions                 = (known after apply)
      + container_registry_name = "avmtelemetry"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "_repositories_push"
      + resource_group_name     = "avm-telemetry"
    }

  # module.acr.azurerm_container_registry.this will be updated in-place
  ~ resource "azurerm_container_registry" "this" {
        id                            = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry"
        name                          = "avmtelemetry"
      ~ network_rule_set              = [
          ~ {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change.
              ~ ip_rule         = (sensitive value)
                # (2 unchanged attributes hidden)
            },
        ]
        tags                          = {}
        # (15 unchanged attributes hidden)
    }

  # module.container_apps.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "other"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + name                                  = "avm-telemetry"
      + resource_group_name                   = "avm-telemetry"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # module.docker_image.docker_image.proxy will be created
  + resource "docker_image" "proxy" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "avmtelemetry.azurecr.io/telemetry_proxy"
      + repo_digest = (known after apply)
      + triggers    = {
          + "code_hash" = "100a9d3f0e4fc1f2a80bbc6b969670c4"
        }

      + build {
          + cache_from   = []
          + context      = "docker_image"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "avmtelemetry.azurecr.io/telemetry_proxy:latest",
            ]
        }
    }

  # module.docker_image.docker_registry_image.proxy will be created
  + resource "docker_registry_image" "proxy" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "avmtelemetry.azurecr.io/telemetry_proxy"
      + sha256_digest        = (known after apply)
    }

  # module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"] will be created
  + resource "azurerm_container_app" "container_app" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "telemetry-proxy"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "avm-telemetry"
      + revision_mode                 = "Single"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "secname"
          + server               = "avmtelemetry.azurecr.io"
          + username             = "pull-token"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = (known after apply)
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "avmtelemetry.azurecr.io/telemetry_proxy"
              + memory            = "0.5Gi"
              + name              = "telemetry-proxy"

              + env {
                  + name        = "INSTRUMENTATION_KEY"
                  + secret_name = "ikey"
                }
              + env {
                  + name  = "PORT"
                  + value = "8080"
                }
            }
        }
    }

  # module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env will be created
  + resource "azurerm_container_app_environment" "container_env" {
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + infrastructure_subnet_id         = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/virtualNetworks/telemetry/subnets/containerapps"
      + internal_load_balancer_enabled   = false
      + location                         = "eastus"
      + log_analytics_workspace_id       = (known after apply)
      + name                             = "telemetry-proxy"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "avm-telemetry"
      + static_ip_address                = (known after apply)
    }

  # module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0] will be created
  + resource "azurerm_log_analytics_workspace" "laws" {
      + allow_resource_only_permissions = true
      + cmk_for_query_forced            = false
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "telemetry-proxy-log-analytics-workspace"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "avm-telemetry"
      + retention_in_days               = (known after apply)
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.acr.data.azurerm_container_registry_scope_map.pull will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "azurerm_container_registry_scope_map" "pull" {%0A      + actions                 = (known after apply)%0A      + container_registry_name = "avmtelemetry"%0A      + description             = (known after apply)%0A      + id                      = (known after apply)%0A      + name                    = "_repositories_pull"%0A      + resource_group_name     = "avm-telemetry"%0A    }%0A%0A  # module.acr.data.azurerm_container_registry_scope_map.push will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "azurerm_container_registry_scope_map" "push" {%0A      + actions                 = (known after apply)%0A      + container_registry_name = "avmtelemetry"%0A      + description             = (known after apply)%0A      + id                      = (known after apply)%0A      + name                    = "_repositories_push"%0A      + resource_group_name     = "avm-telemetry"%0A    }%0A%0A  # module.acr.azurerm_container_registry.this will be updated in-place%0A  ~ resource "azurerm_container_registry" "this" {%0A        id                            = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry"%0A        name                          = "avmtelemetry"%0A      ~ network_rule_set              = [%0A          ~ {%0A              # Warning: this attribute value will be marked as sensitive and will not%0A              # display in UI output after applying this change.%0A              ~ ip_rule         = (sensitive value)%0A                # (2 unchanged attributes hidden)%0A            },%0A        ]%0A        tags                          = {}%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.container_apps.azurerm_application_insights.this will be created%0A  + resource "azurerm_application_insights" "this" {%0A      + app_id                                = (known after apply)%0A      + application_type                      = "other"%0A      + connection_string                     = (sensitive value)%0A      + daily_data_cap_in_gb                  = (known after apply)%0A      + daily_data_cap_notifications_disabled = (known after apply)%0A      + disable_ip_masking                    = false%0A      + force_customer_storage_for_profiler   = false%0A      + id                                    = (known after apply)%0A      + instrumentation_key                   = (sensitive value)%0A      + internet_ingestion_enabled            = true%0A      + internet_query_enabled                = true%0A      + local_authentication_disabled         = false%0A      + location                              = "eastus"%0A      + name                                  = "avm-telemetry"%0A      + resource_group_name                   = "avm-telemetry"%0A      + retention_in_days                     = 90%0A      + sampling_percentage                   = 100%0A    }%0A%0A  # module.docker_image.docker_image.proxy will be created%0A  + resource "docker_image" "proxy" {%0A      + id          = (known after apply)%0A      + image_id    = (known after apply)%0A      + name        = "avmtelemetry.azurecr.io/telemetry_proxy"%0A      + repo_digest = (known after apply)%0A      + triggers    = {%0A          + "code_hash" = "100a9d3f0e4fc1f2a80bbc6b969670c4"%0A        }%0A%0A      + build {%0A          + cache_from   = []%0A          + context      = "docker_image"%0A          + dockerfile   = "Dockerfile"%0A          + extra_hosts  = []%0A          + remove       = true%0A          + security_opt = []%0A          + tag          = [%0A              + "avmtelemetry.azurecr.io/telemetry_proxy:latest",%0A            ]%0A        }%0A    }%0A%0A  # module.docker_image.docker_registry_image.proxy will be created%0A  + resource "docker_registry_image" "proxy" {%0A      + id                   = (known after apply)%0A      + insecure_skip_verify = false%0A      + keep_remotely        = true%0A      + name                 = "avmtelemetry.azurecr.io/telemetry_proxy"%0A      + sha256_digest        = (known after apply)%0A    }%0A%0A  # module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"] will be created%0A  + resource "azurerm_container_app" "container_app" {%0A      + container_app_environment_id  = (known after apply)%0A      + custom_domain_verification_id = (sensitive value)%0A      + id                            = (known after apply)%0A      + latest_revision_fqdn          = (known after apply)%0A      + latest_revision_name          = (known after apply)%0A      + location                      = (known after apply)%0A      + name                          = "telemetry-proxy"%0A      + outbound_ip_addresses         = (known after apply)%0A      + resource_group_name           = "avm-telemetry"%0A      + revision_mode                 = "Single"%0A%0A      + ingress {%0A          + allow_insecure_connections = false%0A          + external_enabled           = true%0A          + fqdn                       = (known after apply)%0A          + target_port                = 8080%0A          + transport                  = "auto"%0A%0A          + traffic_weight {%0A              + latest_revision = true%0A              + percentage      = 100%0A            }%0A        }%0A%0A      + registry {%0A          + password_secret_name = "secname"%0A          + server               = "avmtelemetry.azurecr.io"%0A          + username             = "pull-token"%0A        }%0A%0A      + secret {%0A          # At least one attribute in this block is (or was) sensitive,%0A          # so its contents will not be displayed.%0A        }%0A      + secret {%0A          # At least one attribute in this block is (or was) sensitive,%0A          # so its contents will not be displayed.%0A        }%0A%0A      + template {%0A          + max_replicas    = 10%0A          + min_replicas    = (known after apply)%0A          + revision_suffix = (known after apply)%0A%0A          + container {%0A              + cpu               = 0.25%0A              + ephemeral_storage = (known after apply)%0A              + image             = "avmtelemetry.azurecr.io/telemetry_proxy"%0A              + memory            = "0.5Gi"%0A              + name              = "telemetry-proxy"%0A%0A              + env {%0A                  + name        = "INSTRUMENTATION_KEY"%0A                  + secret_name = "ikey"%0A                }%0A              + env {%0A                  + name  = "PORT"%0A                  + value = "8080"%0A                }%0A            }%0A        }%0A    }%0A%0A  # module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env will be created%0A  + resource "azurerm_container_app_environment" "container_env" {%0A      + default_domain                   = (known after apply)%0A      + docker_bridge_cidr               = (known after apply)%0A      + id                               = (known after apply)%0A      + infrastructure_subnet_id         = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/virtualNetworks/telemetry/subnets/containerapps"%0A      + internal_load_balancer_enabled   = false%0A      + location                         = "eastus"%0A      + log_analytics_workspace_id       = (known after apply)%0A      + name                             = "telemetry-proxy"%0A      + platform_reserved_cidr           = (known after apply)%0A      + platform_reserved_dns_ip_address = (known after apply)%0A      + resource_group_name              = "avm-telemetry"%0A      + static_ip_address                = (known after apply)%0A    }%0A%0A  # module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0] will be created%0A  + resource "azurerm_log_analytics_workspace" "laws" {%0A      + allow_resource_only_permissions = true%0A      + cmk_for_query_forced            = false%0A      + daily_quota_gb                  = -1%0A      + id                              = (known after apply)%0A      + internet_ingestion_enabled      = true%0A      + internet_query_enabled          = true%0A      + local_authentication_disabled   = false%0A      + location                        = "eastus"%0A      + name                            = "telemetry-proxy-log-analytics-workspace"%0A      + primary_shared_key              = (sensitive value)%0A      + resource_group_name             = "avm-telemetry"%0A      + retention_in_days               = (known after apply)%0A      + secondary_shared_key            = (sensitive value)%0A      + sku                             = "PerGB2018"%0A      + workspace_id                    = (known after apply)%0A    }%0A%0APlan: 6 to add, 1 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```